grevaillot/svd_tools/headers/STM32H753x/gpioj.h
#pragma once 

/* --- GPIOJ: GPIO -------------------------------------------------- */

/** @defgroup gpioj_registers GPIO Register
@{*/

/** GPIOJ_MODER GPIO port mode register **/
#define GPIOJ_MODER			MMIO32(GPIOJ_BASE + 0x00)
/** GPIOJ_OTYPER GPIO port output type register **/
#define GPIOJ_OTYPER			MMIO32(GPIOJ_BASE + 0x04)
/** GPIOJ_OSPEEDR GPIO port output speed register **/
#define GPIOJ_OSPEEDR			MMIO32(GPIOJ_BASE + 0x08)
/** GPIOJ_PUPDR GPIO port pull-up/pull-down register **/
#define GPIOJ_PUPDR			MMIO32(GPIOJ_BASE + 0x0c)
/** GPIOJ_IDR GPIO port input data register **/
#define GPIOJ_IDR			MMIO32(GPIOJ_BASE + 0x10)
/** GPIOJ_ODR GPIO port output data register **/
#define GPIOJ_ODR			MMIO32(GPIOJ_BASE + 0x14)
/** GPIOJ_BSRR GPIO port bit set/reset register **/
#define GPIOJ_BSRR			MMIO32(GPIOJ_BASE + 0x18)
/** GPIOJ_LCKR This register is used to lock the configuration of the port bits when a correct write sequence is applied to bit 16 (LCKK). The value of bits [15:0] is used to lock the configuration of the GPIO. During the write sequence, the value of LCKR[15:0] must not change. When the LOCK sequence has been applied on a port bit, the value of this port bit can no longer be modified until the next MCU reset or peripheral reset.A specific write sequence is used to write to the GPIOx_LCKR register. Only word access (32-bit long) is allowed during this locking sequence.Each lock bit freezes a specific configuration register (control and alternate function registers). **/
#define GPIOJ_LCKR			MMIO32(GPIOJ_BASE + 0x1c)
/** GPIOJ_AFRL GPIO alternate function low register **/
#define GPIOJ_AFRL			MMIO32(GPIOJ_BASE + 0x20)
/** GPIOJ_AFRH GPIO alternate function high register **/
#define GPIOJ_AFRH			MMIO32(GPIOJ_BASE + 0x24)

/**@}*/


/** @defgroup gpioj_moder MODER GPIO port mode register
@{*/


#define GPIOJ_MODER_MODE15_SHIFT		30
#define GPIOJ_MODER_MODE15_MASK		0x03
/** @defgroup gpioj_moder_mode15 MODE15 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOJ_MODER_MODE14_SHIFT		28
#define GPIOJ_MODER_MODE14_MASK		0x03
/** @defgroup gpioj_moder_mode14 MODE14 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOJ_MODER_MODE13_SHIFT		26
#define GPIOJ_MODER_MODE13_MASK		0x03
/** @defgroup gpioj_moder_mode13 MODE13 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOJ_MODER_MODE12_SHIFT		24
#define GPIOJ_MODER_MODE12_MASK		0x03
/** @defgroup gpioj_moder_mode12 MODE12 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOJ_MODER_MODE11_SHIFT		22
#define GPIOJ_MODER_MODE11_MASK		0x03
/** @defgroup gpioj_moder_mode11 MODE11 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOJ_MODER_MODE10_SHIFT		20
#define GPIOJ_MODER_MODE10_MASK		0x03
/** @defgroup gpioj_moder_mode10 MODE10 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOJ_MODER_MODE9_SHIFT		18
#define GPIOJ_MODER_MODE9_MASK		0x03
/** @defgroup gpioj_moder_mode9 MODE9 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOJ_MODER_MODE8_SHIFT		16
#define GPIOJ_MODER_MODE8_MASK		0x03
/** @defgroup gpioj_moder_mode8 MODE8 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOJ_MODER_MODE7_SHIFT		14
#define GPIOJ_MODER_MODE7_MASK		0x03
/** @defgroup gpioj_moder_mode7 MODE7 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOJ_MODER_MODE6_SHIFT		12
#define GPIOJ_MODER_MODE6_MASK		0x03
/** @defgroup gpioj_moder_mode6 MODE6 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOJ_MODER_MODE5_SHIFT		10
#define GPIOJ_MODER_MODE5_MASK		0x03
/** @defgroup gpioj_moder_mode5 MODE5 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOJ_MODER_MODE4_SHIFT		8
#define GPIOJ_MODER_MODE4_MASK		0x03
/** @defgroup gpioj_moder_mode4 MODE4 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOJ_MODER_MODE3_SHIFT		6
#define GPIOJ_MODER_MODE3_MASK		0x03
/** @defgroup gpioj_moder_mode3 MODE3 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOJ_MODER_MODE2_SHIFT		4
#define GPIOJ_MODER_MODE2_MASK		0x03
/** @defgroup gpioj_moder_mode2 MODE2 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOJ_MODER_MODE1_SHIFT		2
#define GPIOJ_MODER_MODE1_MASK		0x03
/** @defgroup gpioj_moder_mode1 MODE1 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


#define GPIOJ_MODER_MODE0_SHIFT		0
#define GPIOJ_MODER_MODE0_MASK		0x03
/** @defgroup gpioj_moder_mode0 MODE0 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O mode.
@{*/
/**@}*/


/**@}*/

/** @defgroup gpioj_otyper OTYPER GPIO port output type register
@{*/

/** GPIOJ_OTYPER_OT15 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOJ_OTYPER_OT15		(1 << 15)
/** GPIOJ_OTYPER_OT14 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOJ_OTYPER_OT14		(1 << 14)
/** GPIOJ_OTYPER_OT13 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOJ_OTYPER_OT13		(1 << 13)
/** GPIOJ_OTYPER_OT12 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOJ_OTYPER_OT12		(1 << 12)
/** GPIOJ_OTYPER_OT11 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOJ_OTYPER_OT11		(1 << 11)
/** GPIOJ_OTYPER_OT10 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOJ_OTYPER_OT10		(1 << 10)
/** GPIOJ_OTYPER_OT9 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOJ_OTYPER_OT9		(1 << 9)
/** GPIOJ_OTYPER_OT8 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOJ_OTYPER_OT8		(1 << 8)
/** GPIOJ_OTYPER_OT7 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOJ_OTYPER_OT7		(1 << 7)
/** GPIOJ_OTYPER_OT6 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOJ_OTYPER_OT6		(1 << 6)
/** GPIOJ_OTYPER_OT5 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOJ_OTYPER_OT5		(1 << 5)
/** GPIOJ_OTYPER_OT4 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOJ_OTYPER_OT4		(1 << 4)
/** GPIOJ_OTYPER_OT3 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOJ_OTYPER_OT3		(1 << 3)
/** GPIOJ_OTYPER_OT2 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOJ_OTYPER_OT2		(1 << 2)
/** GPIOJ_OTYPER_OT1 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOJ_OTYPER_OT1		(1 << 1)
/** GPIOJ_OTYPER_OT0 Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output type. **/
#define GPIOJ_OTYPER_OT0		(1 << 0)

/**@}*/

