grevaillot/svd_tools/headers/STM32H753x/gpioj.h
/** @defgroup gpioj_pupdr PUPDR GPIO port pull-up/pull-down register
@{*/


#define GPIOJ_PUPDR_PUPD15_SHIFT		30
#define GPIOJ_PUPDR_PUPD15_MASK		0x03
/** @defgroup gpioj_pupdr_pupd15 PUPD15 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOJ_PUPDR_PUPD14_SHIFT		28
#define GPIOJ_PUPDR_PUPD14_MASK		0x03
/** @defgroup gpioj_pupdr_pupd14 PUPD14 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOJ_PUPDR_PUPD13_SHIFT		26
#define GPIOJ_PUPDR_PUPD13_MASK		0x03
/** @defgroup gpioj_pupdr_pupd13 PUPD13 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOJ_PUPDR_PUPD12_SHIFT		24
#define GPIOJ_PUPDR_PUPD12_MASK		0x03
/** @defgroup gpioj_pupdr_pupd12 PUPD12 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOJ_PUPDR_PUPD11_SHIFT		22
#define GPIOJ_PUPDR_PUPD11_MASK		0x03
/** @defgroup gpioj_pupdr_pupd11 PUPD11 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOJ_PUPDR_PUPD10_SHIFT		20
#define GPIOJ_PUPDR_PUPD10_MASK		0x03
/** @defgroup gpioj_pupdr_pupd10 PUPD10 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOJ_PUPDR_PUPD9_SHIFT		18
#define GPIOJ_PUPDR_PUPD9_MASK		0x03
/** @defgroup gpioj_pupdr_pupd9 PUPD9 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOJ_PUPDR_PUPD8_SHIFT		16
#define GPIOJ_PUPDR_PUPD8_MASK		0x03
/** @defgroup gpioj_pupdr_pupd8 PUPD8 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOJ_PUPDR_PUPD7_SHIFT		14
#define GPIOJ_PUPDR_PUPD7_MASK		0x03
/** @defgroup gpioj_pupdr_pupd7 PUPD7 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOJ_PUPDR_PUPD6_SHIFT		12
#define GPIOJ_PUPDR_PUPD6_MASK		0x03
/** @defgroup gpioj_pupdr_pupd6 PUPD6 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOJ_PUPDR_PUPD5_SHIFT		10
#define GPIOJ_PUPDR_PUPD5_MASK		0x03
/** @defgroup gpioj_pupdr_pupd5 PUPD5 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOJ_PUPDR_PUPD4_SHIFT		8
#define GPIOJ_PUPDR_PUPD4_MASK		0x03
/** @defgroup gpioj_pupdr_pupd4 PUPD4 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOJ_PUPDR_PUPD3_SHIFT		6
#define GPIOJ_PUPDR_PUPD3_MASK		0x03
/** @defgroup gpioj_pupdr_pupd3 PUPD3 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOJ_PUPDR_PUPD2_SHIFT		4
#define GPIOJ_PUPDR_PUPD2_MASK		0x03
/** @defgroup gpioj_pupdr_pupd2 PUPD2 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOJ_PUPDR_PUPD1_SHIFT		2
#define GPIOJ_PUPDR_PUPD1_MASK		0x03
/** @defgroup gpioj_pupdr_pupd1 PUPD1 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOJ_PUPDR_PUPD0_SHIFT		0
#define GPIOJ_PUPDR_PUPD0_MASK		0x03
/** @defgroup gpioj_pupdr_pupd0 PUPD0 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


/**@}*/

/** @defgroup gpioj_idr IDR GPIO port input data register
@{*/

/** GPIOJ_IDR_ID15 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOJ_IDR_ID15		(1 << 15)
/** GPIOJ_IDR_ID14 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOJ_IDR_ID14		(1 << 14)
/** GPIOJ_IDR_ID13 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOJ_IDR_ID13		(1 << 13)
/** GPIOJ_IDR_ID12 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOJ_IDR_ID12		(1 << 12)
/** GPIOJ_IDR_ID11 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOJ_IDR_ID11		(1 << 11)
/** GPIOJ_IDR_ID10 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOJ_IDR_ID10		(1 << 10)
/** GPIOJ_IDR_ID9 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOJ_IDR_ID9		(1 << 9)
/** GPIOJ_IDR_ID8 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOJ_IDR_ID8		(1 << 8)
/** GPIOJ_IDR_ID7 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOJ_IDR_ID7		(1 << 7)
/** GPIOJ_IDR_ID6 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOJ_IDR_ID6		(1 << 6)
/** GPIOJ_IDR_ID5 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOJ_IDR_ID5		(1 << 5)
/** GPIOJ_IDR_ID4 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOJ_IDR_ID4		(1 << 4)
/** GPIOJ_IDR_ID3 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOJ_IDR_ID3		(1 << 3)
/** GPIOJ_IDR_ID2 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOJ_IDR_ID2		(1 << 2)
/** GPIOJ_IDR_ID1 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOJ_IDR_ID1		(1 << 1)
/** GPIOJ_IDR_ID0 Port input data bit (y = 0..15) These bits are read-only. They contain the input value of the corresponding I/O port. **/
#define GPIOJ_IDR_ID0		(1 << 0)

/**@}*/

/** @defgroup gpioj_odr ODR GPIO port output data register
@{*/

/** GPIOJ_ODR_OD15 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOJ_ODR_OD15		(1 << 15)
/** GPIOJ_ODR_OD14 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOJ_ODR_OD14		(1 << 14)
/** GPIOJ_ODR_OD13 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOJ_ODR_OD13		(1 << 13)
/** GPIOJ_ODR_OD12 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOJ_ODR_OD12		(1 << 12)
/** GPIOJ_ODR_OD11 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOJ_ODR_OD11		(1 << 11)
/** GPIOJ_ODR_OD10 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOJ_ODR_OD10		(1 << 10)
/** GPIOJ_ODR_OD9 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOJ_ODR_OD9		(1 << 9)
/** GPIOJ_ODR_OD8 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOJ_ODR_OD8		(1 << 8)
/** GPIOJ_ODR_OD7 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOJ_ODR_OD7		(1 << 7)
/** GPIOJ_ODR_OD6 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOJ_ODR_OD6		(1 << 6)
/** GPIOJ_ODR_OD5 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOJ_ODR_OD5		(1 << 5)
/** GPIOJ_ODR_OD4 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOJ_ODR_OD4		(1 << 4)
/** GPIOJ_ODR_OD3 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOJ_ODR_OD3		(1 << 3)
/** GPIOJ_ODR_OD2 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOJ_ODR_OD2		(1 << 2)
/** GPIOJ_ODR_OD1 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOJ_ODR_OD1		(1 << 1)
/** GPIOJ_ODR_OD0 Port output data bit These bits can be read and written by software. Note: For atomic bit set/reset, the OD bits can be individually set and/or reset by writing to the GPIOx_BSRR or GPIOx_BRR registers (x = A..F). **/
#define GPIOJ_ODR_OD0		(1 << 0)

/**@}*/

/** @defgroup gpioj_bsrr BSRR GPIO port bit set/reset register
@{*/

/** GPIOJ_BSRR_BR15 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_BSRR_BR15		(1 << 31)
/** GPIOJ_BSRR_BR14 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_BSRR_BR14		(1 << 30)
/** GPIOJ_BSRR_BR13 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_BSRR_BR13		(1 << 29)
/** GPIOJ_BSRR_BR12 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_BSRR_BR12		(1 << 28)
/** GPIOJ_BSRR_BR11 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_BSRR_BR11		(1 << 27)
/** GPIOJ_BSRR_BR10 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_BSRR_BR10		(1 << 26)
/** GPIOJ_BSRR_BR9 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_BSRR_BR9		(1 << 25)
/** GPIOJ_BSRR_BR8 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_BSRR_BR8		(1 << 24)
/** GPIOJ_BSRR_BR7 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_BSRR_BR7		(1 << 23)
/** GPIOJ_BSRR_BR6 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_BSRR_BR6		(1 << 22)
/** GPIOJ_BSRR_BR5 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_BSRR_BR5		(1 << 21)
/** GPIOJ_BSRR_BR4 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_BSRR_BR4		(1 << 20)
/** GPIOJ_BSRR_BR3 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_BSRR_BR3		(1 << 19)
/** GPIOJ_BSRR_BR2 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_BSRR_BR2		(1 << 18)
/** GPIOJ_BSRR_BR1 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_BSRR_BR1		(1 << 17)
/** GPIOJ_BSRR_BR0 Port x reset bit y (y = 0..15) These bits are write-only. A read to these bits returns the value 0x0000. Note: If both BSx and BRx are set, BSx has priority. **/
#define GPIOJ_BSRR_BR0		(1 << 16)
/** GPIOJ_BSRR_BS15 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_BSRR_BS15		(1 << 15)
/** GPIOJ_BSRR_BS14 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_BSRR_BS14		(1 << 14)
/** GPIOJ_BSRR_BS13 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_BSRR_BS13		(1 << 13)
/** GPIOJ_BSRR_BS12 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_BSRR_BS12		(1 << 12)
/** GPIOJ_BSRR_BS11 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_BSRR_BS11		(1 << 11)
/** GPIOJ_BSRR_BS10 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_BSRR_BS10		(1 << 10)
/** GPIOJ_BSRR_BS9 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_BSRR_BS9		(1 << 9)
/** GPIOJ_BSRR_BS8 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_BSRR_BS8		(1 << 8)
/** GPIOJ_BSRR_BS7 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_BSRR_BS7		(1 << 7)
/** GPIOJ_BSRR_BS6 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_BSRR_BS6		(1 << 6)
/** GPIOJ_BSRR_BS5 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_BSRR_BS5		(1 << 5)
/** GPIOJ_BSRR_BS4 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_BSRR_BS4		(1 << 4)
/** GPIOJ_BSRR_BS3 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_BSRR_BS3		(1 << 3)
/** GPIOJ_BSRR_BS2 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_BSRR_BS2		(1 << 2)
/** GPIOJ_BSRR_BS1 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_BSRR_BS1		(1 << 1)
/** GPIOJ_BSRR_BS0 Port x set bit y (y= 0..15) These bits are write-only. A read to these bits returns the value 0x0000. **/
#define GPIOJ_BSRR_BS0		(1 << 0)

/**@}*/

/** @defgroup gpioj_lckr LCKR This register is used to lock the configuration of the port bits when a correct write sequence is applied to bit 16 (LCKK). The value of bits [15:0] is used to lock the configuration of the GPIO. During the write sequence, the value of LCKR[15:0] must not change. When the LOCK sequence has been applied on a port bit, the value of this port bit can no longer be modified until the next MCU reset or peripheral reset.A specific write sequence is used to write to the GPIOx_LCKR register. Only word access (32-bit long) is allowed during this locking sequence.Each lock bit freezes a specific configuration register (control and alternate function registers).
@{*/

